{"data":{"docBySlug":{"html":"<h1 id=\"whats-next-for-apache-arrow-in-javascript\"><a href=\"#whats-next-for-apache-arrow-in-javascript\" aria-label=\"whats next for apache arrow in javascript permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>What's Next for Apache Arrow in Javascript</h1>\n<p>There are a lot of features we'd like to add over the next few Javascript releases:</p>\n<ul>\n<li>\n<p><strong>Inline predicates</strong>: Function calls in the inner loop of a scan over millions of records can be very expensive. We can potentially save that time by generating a new scan function with the predicates inlined when a filter is created.</p>\n</li>\n<li>\n<p><strong>Cache filter results</strong>: Right now every time we do a scan on a filtered DataFrame we re-check the predicate on every row. There should be an (optional?) lazily computed index to store the predicate results for subsequent re-use.</p>\n</li>\n<li>\n<p><strong>Friendlier API</strong>: I shouldn't have to write a custom scan function just to take a look at the results of a filter! Every DataFrame should have a toJSON() function (See ARROW-2202).</p>\n</li>\n<li>\n<p><strong>node.js ↔ (Python, C++, Java, ...) interaction</strong>: A big benefit of Arrow's common in-memory format is that different tools can operate on the same memory. Unfortunately we're pretty closed off in the browser, but node doesn't have that problem! Finishing ARROW-1700, node.js Plasma store client should make this type of interaction possible.</p>\n</li>\n</ul>\n<p>Have an idea? Tell us! Generally JIRAs are preferred but we'll take GitHub issues too. If you just want to discuss something, reach out on the mailing list or slack. But PRs are the best of all, we can always use more contributors!</p>\n<ul>\n<li><strong>Tensors</strong> - Not yet implemented.</li>\n</ul>","timeToRead":1,"excerpt":"What's Next for Apache Arrow in Javascript There are a lot of features we'd like to add over the next few Javascript releases: Inline…","frontmatter":{"title":"What's Next for Apache Arrow in Javascript","cover":"cover","category":"docs","tags":["default"]}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"relativeLinks":{},"slug":"docs/roadmap","toc":"docs"}}